app/controllers/animals_controller.rb

SELECT  "animals".* FROM "animals" WHERE "animals"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @animal = Animal.find(params[:id])